<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"4764d764264754feaa8cb21bfa3a27801d05c967a4f1b765b446e939b39a1e31","plan_job_ref":"Job Terraform Plan #64 at https://github.com/ironashram/kub1k/actions/runs/8350682039","plan_out_hash":"48261044b81602cf9a43ab4c18c6ac3872d4872fec9460afe26867c348975b07","plan_hash":"887bf5811b16141b75fe3ac34e56c6d83950c926f37f1493f860614395c2daf3","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 4 to add, 1 to change, 4 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_control["kub1k-control-01"] must be replaced
-/+ resource "null_resource" "k3s_control" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "md5_main" = "685c6fb4c487c965ea3ae0a93d4376cc" -> "df07e3e3ca49560555fd72721358d564"
#            (1 unchanged element hidden)
        }
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
+           "md5_main"  = "df07e3e3ca49560555fd72721358d564"
+           "md5_vars"  = "3619e9cdd016a71157a8c95d220c7bec"
-           "timestamp" = "2024-03-19T21:54:10Z" -> null
        }
    }

  # module.provision_k3s.null_resource.k3s_worker["kub1k-worker-01"] must be replaced
-/+ resource "null_resource" "k3s_worker" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "md5_main" = "685c6fb4c487c965ea3ae0a93d4376cc" -> "df07e3e3ca49560555fd72721358d564"
#            (1 unchanged element hidden)
        }
    }

  # module.provision_k3s.null_resource.k3s_worker["kub1k-worker-02"] must be replaced
-/+ resource "null_resource" "k3s_worker" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "md5_main" = "685c6fb4c487c965ea3ae0a93d4376cc" -> "df07e3e3ca49560555fd72721358d564"
#            (1 unchanged element hidden)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #64](https://github.com/ironashram/kub1k/actions/runs/8350682039)